UPDATE studs SET scholarship = 120 WHERE st_form = "budget";
UPDATE studs SET fee = 5000 WHERE st_form = "paid";

INSERT INTO st_group(enroll_year, num, course, speciality)
VALUES
(2021, 1, 3, "Эконом"),
(2021, 3, 3, "Веб"),
(2022, 3, 2, "Веб"),
(2023, 3, 1, "Веб"),
(2023, 2, 1, "Веб"),
(2021, 5, 3, "КМ"),
(2022, 5, 2, "КМ"),
(2022, 4, 2, "КМ"),
(2023, 5, 1, "КМ"),
(2021, 9, 3, "Механик"),
(2022, 9, 2, "Механик"),
(2023, 9, 1, "Механик"),
(2023, 10, 1, "Механик");

INSERT INTO studs (st_name, st_surname, st_group_id, st_form, st_value, st_birthdate)
VALUES
('Алексей', 'Соколов', 1, 'budget', 8.8, '2004-11-12'),
('Елена', 'Кузнецова', 1, 'paid', 6.2, '2003-10-02'),
('Сергей', 'Иванов', 3, 'budget', 8.9, '2005-09-10'),
('Анна', 'Петрова', 4, 'paid', 9.8, '2006-03-02'),
('Игорь', 'Козлов', 4, 'budget', 7.3, '2005-01-20'),
('Татьяна', 'Морозова', 8, 'paid', 6.7, '2006-11-12'),
('Михаил', 'Лебедев', 6, 'budget', 8.1, '2002-10-21'),
('Екатерина', 'Сидорова', 6, 'paid', 6.5, '2003-10-11'),
('Дмитрий', 'Новиков', 6, 'budget', 5.4, '2003-01-22'),
('Ольга', 'Волкова', 6, 'paid', 6.1, '2004-11-14'),
('Николай', 'Федоров', 7, 'budget', 5.7, '2005-11-17'),
('Ирина', 'Иванова', 7, 'paid', 8.6, '2004-09-01'),
('Павел', 'Ковалев',  6, 'budget', 9.0, '2003-01-07'),
('Маргарита', 'Смирнова', 7, 'paid', 4.5, '2004-12-12'),
('Александра', 'Кузнецова', 8, 'paid', 7.3, '2006-07-08');

INSERT INTO studs (st_name, st_surname, st_group_id, st_form, st_value, st_birthdate)
VALUES
('Андрей', 'Попов', 3, 'budget', 7.5, '2004-08-15'),
('Юлия', 'Васнецова', 2, 'paid', 5.8, '2003-06-30'),
('Владимир', 'Смирнов', 1, 'budget', 8.3, '2005-03-25'),
('Екатерина', 'Лисина', 3, 'paid', 6.9, '2004-02-18'),
('Денис', 'Королев', 2, 'budget', 7.2, '2005-07-12'),
('Наталья', 'Белкина', 4, 'paid', 8.7, '2003-12-05'),
('Артем', 'Поляков', 1, 'budget', 9.5, '2002-11-01'),
('Светлана', 'Мельникова', 4, 'paid', 5.5, '2004-09-15'),
('Виктор', 'Игнатьев', 3, 'budget', 6.8, '2005-10-20'),
('Мария', 'Федотова', 2, 'paid', 7.4, '2003-04-08');

INSERT INTO subjects (sub_name, sub_teacher, sub_hours)
VALUES
('Алгебра', 'Алексеев', 55),
('Алгебра', 'Васильев', 45),
('Геометрия', 'Сидоров', 40),
('Геометрия', 'Евгеньев', 30),
('Физическая культура', 'Калантай', 100),
('Дискретная математика', 'Сидорова', 25),
('Теория чисел', 'Ильин', 35),
('Теория чисел', 'Морозов', 35),
('Математическая логика', 'Васильев', 45),
('Математический анализ', 'Морозов', 30),
('Топология', 'Игнатенко', 50),
('Топология', 'Морозов', 20),
('Дифференциальные уравнения', 'Пивоваров', 20),
('Дифференциальные уравнения', 'Алексеев', 20);

DELETE FROM group_subjects;
INSERT INTO group_subjects (st_group_id, sub_id, sub_teacher_practice, sub_teacher_lecture, credit, exam)
VALUES
(1, 1, 'Алексеев', 'Алексеев', TRUE, FALSE),
(1, 3, 'Сидоров', 'Морозов', FALSE, TRUE),
(1, 5, 'Калантай', 'Калантай', TRUE, TRUE),
(1, 7, 'Ильин', 'Ильин', FALSE, TRUE),
(6, 1, 'Алексеев', 'Алексеев', FALSE, TRUE),
(6, 3, 'Сидоров', 'Морозов', FALSE, TRUE),
(6, 5, 'Калантай', 'Калантай', TRUE, TRUE),
(6, 7, 'Ильин', 'Ильин', FALSE, TRUE),
(2, 2, 'Ильин', 'Васильев', TRUE, TRUE),
(2, 4, 'Евгеньев', 'Евгеньев', TRUE, TRUE),
(2, 6, 'Сидорова', 'Сидорова', TRUE, TRUE),
(3, 1, 'Алексеев', 'Морозов', FALSE, TRUE),
(3, 8, 'Морозов', 'Морозов', TRUE, FALSE),
(3, 10, 'Васильев', 'Васильев', TRUE, TRUE),
(8, 3, 'Игнатенко', 'Сидоров', TRUE, FALSE),
(8, 9, 'Пивоваров', 'Морозов', FALSE, TRUE),
(8, 11, 'Игнатенко', 'Игнатенко', FALSE, TRUE),
(8, 1, 'Алексеев', 'Морозов', TRUE, FALSE),
(8, 8, 'Морозов', 'Морозов', TRUE, TRUE),
(3, 12, 'Васильев', 'Васильев', TRUE, FALSE);


#______________________2______________________

DELETE FROM attendance;
INSERT INTO attendance(attendance_date, student_id, subject_id, attendance_TF, grade)
VALUES 
('2023-09-15', 1, 1, TRUE, 8),
('2023-09-15', 1, 3, TRUE, 9),
('2023-09-15', 1, 5, TRUE, 10),
('2023-09-15', 2, 2, TRUE, 7),
('2023-09-15', 2, 4, TRUE, 6),
('2023-10-15', 2, 6, FALSE, NULL),
('2023-10-15', 3, 1, TRUE, 9),
('2023-10-15', 3, 8, TRUE, NULL),
('2023-10-15', 3, 10, TRUE, NULL),
('2023-10-15', 4, 3, TRUE, 5),
('2023-10-15', 4, 9, FALSE, NULL),
('2023-10-15', 4, 11, TRUE, 7),
('2023-10-15', 5, 1, TRUE, 6),
('2023-11-15', 5, 3, TRUE, 8),
('2023-11-15', 5, 5, TRUE, NULL),
('2023-11-15', 6, 2, FALSE, NULL),
('2023-11-15', 6, 4, FALSE, NULL),
('2023-11-15', 6, 6, TRUE, 8);

INSERT INTO attendance (attendance_date, student_id, subject_id, attendance_TF, grade)
VALUES
('2023-09-01', 1, 1, TRUE, 8),
('2023-12-01', 1, 3, TRUE, 9),
('2023-12-01', 1, 5, FALSE, NULL),
('2023-09-01', 2, 2, TRUE, 7),
('2023-12-01', 2, 4, TRUE, 6),
('2023-12-01', 2, 6, FALSE, NULL),
('2023-09-01', 3, 1, TRUE, 9),
('2023-12-01', 3, 8, TRUE, 7),
('2023-12-01', 3, 10, TRUE, 8),
('2023-09-02', 4, 3, FALSE,NULL),
('2023-12-02', 4, 9, TRUE, 6),
('2023-12-02', 4, 11, TRUE, 7),
('2023-09-02', 5, 1, TRUE, NULL),
('2023-12-02', 5, 3, TRUE, 8),
('2023-12-22', 5, 5, TRUE, 9),
('2023-09-02', 6, 2, FALSE,NULL),
('2023-12-02', 6, 4, TRUE, NULL),
('2023-12-02', 6, 6, TRUE, NULL),
('2023-09-13', 1, 1, TRUE, 7),
('2023-12-23', 1, 3, TRUE, 8);

INSERT INTO activities (ref_st_id, activity_type, activity_description, activity_date)
VALUES
(1, 'Волонтерская работа', 'Участие в благотворительном мероприятии в детском приюте', '2023-01-20'),
(2, 'Научная конференция', 'Презентация исследования по математике на конференции', '2023-02-05'),
(3, 'Студенческое мероприятие', 'Организация и проведение студенческой вечеринки', '2023-02-15'),
(5, 'Спортивный турнир', 'Участие в университетском турнире по футболу', '2023-03-10'),
(5, 'Творческий конкурс', 'Победа в поэтическом конкурсе университета', '2023-03-25'),
(6, 'Творческий проект', 'Создание иллюстрированной книги для детей', '2023-04-05'),
(7, 'Научный семинар', 'Участие в семинаре по информационным технологиям', '2023-04-12'),
(8, 'Общественная лекция', 'Проведение лекции о влиянии науки на современное общество', '2023-04-20'),
(8, 'Экологическая акция', 'Уборка территории в рамках экологической акции', '2023-05-02'),
(8, 'Спортивный марафон', 'Участие в городском марафоне по бегу', '2023-05-15'),
(1, 'Культурный фестиваль', 'Организация культурного фестиваля на кампусе', '2023-05-25'),
(2, 'Бизнес-семинар', 'Посещение семинара по предпринимательству и бизнесу', '2023-06-10'),
(1, 'Волонтерская акция', 'Помощь в организации благотворительного базара', '2023-06-20'),
(8, 'Творческий вечер', 'Выступление с собственными музыкальными произведениями', '2023-07-05'),
(8, 'Научно-исследовательский проект', 'Участие в исследовательском проекте по физике', '2023-07-15'),
(9, 'Спортивная тренировка', 'Тренировка по волейболу в университетском клубе', '2023-08-02'),
(9, 'Творческий конкурс', 'Участие в конкурсе коротких фильмов', '2023-08-12'),
(10, 'Спортивный соревнования', 'Участие в легкоатлетическом турнире', '2023-09-05'),
(10, 'Благотворительный марафон', 'Участие в забеге для сбора средств на благотворительность', '2023-09-20'),
(10, 'Студенческий форум', 'Представление студенческого проекта на форуме образования', '2023-10-05'); 

INSERT INTO tuition_payments (ref_st_id, amount_due, payment_date, amount_paid)
VALUES
(2, 5000.00, '2023-01-10', 2500.00),
(4, 6000.00, '2023-02-05', 2000.00),
(6, 5500.00, '2023-03-15', 3000.00),
(8, 7000.00, '2023-04-20', 3500.00),
(10, 6500.00, '2023-05-12', 2000.00),
(12, 7500.00, '2023-06-08', 4000.00),
(14, 6000.00, '2023-07-25', 2500.00),
(16, 8000.00, '2023-08-30', 4500.00),
(18, 7000.00, '2023-09-18', 3000.00),
(20, 8500.00, '2023-10-10', 2000.00);

INSERT INTO health_info (ref_st_id, height, weight, allergies, chronic_conditions, blood_type)
VALUES
(1, 175.5, 65.2, 'Пыльца', 'Астма', 'A+'),
(2, 162.3, 55.8, 'Нет', 'Нет', 'O-'),
(3, 180.0, 75.0, 'Пищевые продукты', 'Диабет', 'B+'),
(4, 168.8, 68.5, 'Пыльца, Пенициллин', 'Аллергия на антибиотики', 'AB-'),
(5, 155.0, 50.7, 'Пыльца, Кошки', 'Аллергия на кошек', 'A-'),
(6, 185.2, 80.1, 'Пыльца', 'Нет', 'O+'),
(7, 170.6, 72.3, 'Пыльца', 'Аллергия на цветение', 'A-'),
(8, 160.9, 60.0, 'Нет', 'Астма', 'B+'),
(9, 176.8, 70.5, 'Пыльца', 'Нет', 'AB+'),
(10, 158.4, 52.9, 'Пищевые продукты', 'Аллергия на орехи', 'O-');

#______________________3______________________
